# read design 
read_verilog gatemanager.v

# elaborate design hierarchy
hierarchy -check -top gatemanager

# the high-level stuff
# proc; opt; fsm; opt; memory; opt

# mapping to internal cell library
techmap; opt

# mapping logic to cmos_cells.lib
#abc -liberty ./cmos_cells_incompleto.lib

#Generate GraphViz output
 show colors 1

# cleanup
clean

# write synthesized design
write_verilog yosysger.v
