# read design 
read_verilog passmanager.v

# elaborate design hierarchy
hierarchy -check -top passmanager

# the high-level stuff
#proc; opt; fsm; opt; memory; opt

# mapping to internal cell library
# techmap; opt

#Generate GraphViz output
show -colors 1

# cleanup
clean

# write synthesized design
#write_verilog codigo.v
