# read design 
read_verilog parkingmanager.v

# elaborate design hierarchy
hierarchy -check -top parkingmanager


# the high-level stuff
proc; opt; fsm; opt; memory; opt

# mapping to internal cell library
techmap; opt

# mapping flip-flops to cmos_cells.lib

# dfflibmap -liberty ./cmos_cells.lib

# mapping logic to cmos_cells.lib
abc -liberty cmos_cells.lib

#Generate GraphViz output
show -colors 1
 
# cleanup
clean

# write synthesized design
write_verilog PM_synth.v
