# read design 
read_verilog parkingmanager.v

# elaborate design hierarchy
hierarchy -check -top parkingmanager


# the high-level stuff
proc; opt; fsm; opt; memory; opt


#Generate GraphViz output
show -colors 1
 
# cleanup
clean

# write synthesized design
write_verilog PM_synth_RTLIL.v
